CFDEM/CFDEMcoupling/tutorials/cfdemSolverRhoPimple/heatTransferPatil/hw350_u1.71/CFD/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.1;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
